Laboratorio-de-Microprocesadores-2018/Mp3Player/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    gpio_pin_config_t HPR_SENSE_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA14 (pin 44)  */
    GPIO_PinInit(HPR_SENSE_GPIO, HPR_SENSE_PIN, &HPR_SENSE_config);

    gpio_pin_config_t HPL_SENSE_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA15 (pin 45)  */
    GPIO_PinInit(HPL_SENSE_GPIO, HPL_SENSE_PIN, &HPL_SENSE_config);

    gpio_pin_config_t LCD_RESET_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB18 (pin 64)  */
    GPIO_PinInit(LCD_RESET_GPIO, LCD_RESET_PIN, &LCD_RESET_config);

    gpio_pin_config_t LCD_DCRS_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB19 (pin 65)  */
    GPIO_PinInit(LCD_DCRS_GPIO, LCD_DCRS_PIN, &LCD_DCRS_config);

    gpio_pin_config_t LCD_LED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB20 (pin 66)  */
    GPIO_PinInit(LCD_LED_GPIO, LCD_LED_PIN, &LCD_LED_config);

    gpio_pin_config_t BTN_MENU_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB23 (pin 69)  */
    GPIO_PinInit(BTN_MENU_GPIO, BTN_MENU_PIN, &BTN_MENU_config);

    gpio_pin_config_t BTN_NEXT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC0 (pin 70)  */
    GPIO_PinInit(BTN_NEXT_GPIO, BTN_NEXT_PIN, &BTN_NEXT_config);

    gpio_pin_config_t BTN_PLAY_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC2 (pin 72)  */
    GPIO_PinInit(BTN_PLAY_GPIO, BTN_PLAY_PIN, &BTN_PLAY_config);

    gpio_pin_config_t BTN_PREV_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC3 (pin 73)  */
    GPIO_PinInit(BTN_PREV_GPIO, BTN_PREV_PIN, &BTN_PREV_config);

    gpio_pin_config_t PWR_EN_5Vn_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTC4 (pin 76)  */
    GPIO_PinInit(PWR_EN_5Vn_GPIO, PWR_EN_5Vn_PIN, &PWR_EN_5Vn_config);

    gpio_pin_config_t LED_SENSE_3_3V_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC5 (pin 77)  */
    GPIO_PinInit(LED_SENSE_3_3V_GPIO, LED_SENSE_3_3V_PIN, &LED_SENSE_3_3V_config);

    gpio_pin_config_t LOW_BATn_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC13 (pin 85)  */
    GPIO_PinInit(LOW_BATn_GPIO, LOW_BATn_PIN, &LOW_BATn_config);

    gpio_pin_config_t PWR_EN_3V3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC14 (pin 86)  */
    GPIO_PinInit(PWR_EN_3V3_GPIO, PWR_EN_3V3_PIN, &PWR_EN_3V3_config);

    gpio_pin_config_t DONEn_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC16 (pin 90)  */
    GPIO_PinInit(DONEn_GPIO, DONEn_PIN, &DONEn_config);

    gpio_pin_config_t DOK_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC17 (pin 91)  */
    GPIO_PinInit(DOK_GPIO, DOK_PIN, &DOK_config);

    gpio_pin_config_t CHG_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC18 (pin 92)  */
    GPIO_PinInit(CHG_GPIO, CHG_PIN, &CHG_config);

    gpio_pin_config_t DBG1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD0 (pin 93)  */
    GPIO_PinInit(DBG1_GPIO, DBG1_PIN, &DBG1_config);

    gpio_pin_config_t DBG2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD1 (pin 94)  */
    GPIO_PinInit(DBG2_GPIO, DBG2_PIN, &DBG2_config);

    gpio_pin_config_t DBG3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD2 (pin 95)  */
    GPIO_PinInit(DBG3_GPIO, DBG3_PIN, &DBG3_config);

    gpio_pin_config_t DBG4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD3 (pin 96)  */
    GPIO_PinInit(DBG4_GPIO, DBG4_PIN, &DBG4_config);

    gpio_pin_config_t SD_DETECT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD7 (pin 100)  */
    GPIO_PinInit(SD_DETECT_GPIO, SD_DETECT_PIN, &SD_DETECT_config);

    /* PORTA12 (pin 42) is configured as I2S0_TXD0 */
    PORT_SetPinMux(I2S_SDI_PORT, I2S_SDI_PIN, kPORT_MuxAlt6);

