Laboratorio-de-Microprocesadores-2018/Mp3Player/board/pin_mux.c
    /* PORTA13 (pin 43) is configured as I2S0_TX_FS */
    PORT_SetPinMux(I2S_WS_PORT, I2S_WS_PIN, kPORT_MuxAlt6);

    /* PORTA14 (pin 44) is configured as PTA14 */
    PORT_SetPinMux(HPR_SENSE_PORT, HPR_SENSE_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTA14 (pin 44): Interrupt/DMA request is disabled */
    PORT_SetPinInterruptConfig(HPR_SENSE_PORT, HPR_SENSE_PIN, kPORT_InterruptOrDMADisabled);

    /* PORTA15 (pin 45) is configured as PTA15 */
    PORT_SetPinMux(HPL_SENSE_PORT, HPL_SENSE_PIN, kPORT_MuxAsGpio);

    /* PORTA17 (pin 47) is configured as I2S0_MCLK */
    PORT_SetPinMux(I2S_MCLK_PORT, I2S_MCLK_PIN, kPORT_MuxAlt6);

    /* PORTA18 (pin 50) is configured as EXTAL0 */
    PORT_SetPinMux(XTALP_PORT, XTALP_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTA19 (pin 51) is configured as XTAL0 */
    PORT_SetPinMux(XTALN_PORT, XTALN_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTA4 (pin 38) is configured as NMI_b */
    PORT_SetPinMux(NMI_PORT, NMI_PIN, kPORT_MuxAlt7);

    /* PORTA5 (pin 39) is configured as I2S0_TX_BCLK */
    PORT_SetPinMux(I2S_CLK_PORT, I2S_CLK_PIN, kPORT_MuxAlt6);

    /* PORTB0 (pin 53) is configured as FTM1_QD_PHA */
    PORT_SetPinMux(ENC_A_PORT, ENC_A_PIN, kPORT_MuxAlt6);

    /* PORTB1 (pin 54) is configured as FTM1_QD_PHB */
    PORT_SetPinMux(ENC_B_PORT, ENC_B_PIN, kPORT_MuxAlt6);

    /* PORTB10 (pin 58) is configured as SPI1_PCS0 */
    PORT_SetPinMux(LCD_CSn_PORT, LCD_CSn_PIN, kPORT_MuxAlt2);

    /* PORTB11 (pin 59) is configured as SPI1_SCK */
    PORT_SetPinMux(LCD_SCK_PORT, LCD_SCK_PIN, kPORT_MuxAlt2);

    /* PORTB16 (pin 62) is configured as SPI1_SOUT */
    PORT_SetPinMux(LCD_MOSI_PORT, LCD_MOSI_PIN, kPORT_MuxAlt2);

    /* PORTB17 (pin 63) is configured as SPI1_SIN */
    PORT_SetPinMux(LCD_MISO_PORT, LCD_MISO_PIN, kPORT_MuxAlt2);

    /* PORTB18 (pin 64) is configured as PTB18 */
    PORT_SetPinMux(LCD_RESET_PORT, LCD_RESET_PIN, kPORT_MuxAsGpio);

    /* PORTB19 (pin 65) is configured as PTB19 */
    PORT_SetPinMux(LCD_DCRS_PORT, LCD_DCRS_PIN, kPORT_MuxAsGpio);

    /* PORTB2 (pin 55) is configured as I2C0_SCL */
    PORT_SetPinMux(AUD_I2C_SCL_PORT, AUD_I2C_SCL_PIN, kPORT_MuxAlt2);

    /* PORTB20 (pin 66) is configured as PTB20 */
    PORT_SetPinMux(LCD_LED_PORT, LCD_LED_PIN, kPORT_MuxAsGpio);

    /* PORTB22 (pin 68) is configured as SPI2_SOUT */
    PORT_SetPinMux(LED_DATA_PORT, LED_DATA_PIN, kPORT_MuxAlt2);

    /* PORTB23 (pin 69) is configured as PTB23 */
    PORT_SetPinMux(BTN_MENU_PORT, BTN_MENU_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[23] = ((PORTB->PCR[23] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_PFE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp)

                      /* Passive Filter Enable: Passive input filter is enabled on the corresponding pin, if the
                       * pin is configured as a digital input.
                       * Refer to the device data sheet for filter characteristics. */
                      | PORT_PCR_PFE(kPORT_PassiveFilterEnable));

    /* PORTB3 (pin 56) is configured as I2C0_SDA */
    PORT_SetPinMux(AUD_I2C_SDA_PORT, AUD_I2C_SDA_PIN, kPORT_MuxAlt2);

    /* PORTC0 (pin 70) is configured as PTC0 */
    PORT_SetPinMux(BTN_NEXT_PORT, BTN_NEXT_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[0] = ((PORTC->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_PFE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

                     /* Passive Filter Enable: Passive input filter is enabled on the corresponding pin, if the
                      * pin is configured as a digital input.
                      * Refer to the device data sheet for filter characteristics. */
                     | PORT_PCR_PFE(kPORT_PassiveFilterEnable));

    /* PORTC1 (pin 71) is configured as LLWU_P6 */
    PORT_SetPinMux(BTN_SELECT_PORT, BTN_SELECT_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[1] = ((PORTC->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_PFE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

                     /* Passive Filter Enable: Passive input filter is enabled on the corresponding pin, if the
                      * pin is configured as a digital input.
                      * Refer to the device data sheet for filter characteristics. */
                     | PORT_PCR_PFE(kPORT_PassiveFilterEnable));

    /* PORTC10 (pin 82) is configured as I2C1_SCL */
    PORT_SetPinMux(BAT_I2C_SCL_PORT, BAT_I2C_SCL_PIN, kPORT_MuxAlt2);

    /* PORTC11 (pin 83) is configured as I2C1_SDA */
    PORT_SetPinMux(BAT_I2C_SDA_PORT, BAT_I2C_SDA_PIN, kPORT_MuxAlt2);

    /* PORTC13 (pin 85) is configured as PTC13 */
    PORT_SetPinMux(LOW_BATn_PORT, LOW_BATn_PIN, kPORT_MuxAsGpio);

    /* PORTC14 (pin 86) is configured as PTC14 */
    PORT_SetPinMux(PWR_EN_3V3_PORT, PWR_EN_3V3_PIN, kPORT_MuxAsGpio);

    /* PORTC16 (pin 90) is configured as PTC16 */
    PORT_SetPinMux(DONEn_PORT, DONEn_PIN, kPORT_MuxAsGpio);

    /* PORTC17 (pin 91) is configured as PTC17 */
    PORT_SetPinMux(DOK_PORT, DOK_PIN, kPORT_MuxAsGpio);

    /* PORTC18 (pin 92) is configured as PTC18 */
    PORT_SetPinMux(CHG_PORT, CHG_PIN, kPORT_MuxAsGpio);

    /* PORTC2 (pin 72) is configured as PTC2 */
    PORT_SetPinMux(BTN_PLAY_PORT, BTN_PLAY_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[2] = ((PORTC->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_PFE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

