Laboratorio-de-Microprocesadores-2018/Mp3Player/board/pin_mux.c
                     /* Passive Filter Enable: Passive input filter is enabled on the corresponding pin, if the
                      * pin is configured as a digital input.
                      * Refer to the device data sheet for filter characteristics. */
                     | PORT_PCR_PFE(kPORT_PassiveFilterEnable));

    /* PORTC3 (pin 73) is configured as PTC3 */
    PORT_SetPinMux(BTN_PREV_PORT, BTN_PREV_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[3] = ((PORTC->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_PFE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

                     /* Passive Filter Enable: Passive input filter is enabled on the corresponding pin, if the
                      * pin is configured as a digital input.
                      * Refer to the device data sheet for filter characteristics. */
                     | PORT_PCR_PFE(kPORT_PassiveFilterEnable));

    /* PORTC4 (pin 76) is configured as PTC4 */
    PORT_SetPinMux(PWR_EN_5Vn_PORT, PWR_EN_5Vn_PIN, kPORT_MuxAsGpio);

    /* PORTC5 (pin 77) is configured as PTC5 */
    PORT_SetPinMux(LED_SENSE_3_3V_PORT, LED_SENSE_3_3V_PIN, kPORT_MuxAsGpio);
    /* Configure digital filter */
    PORT_EnablePinsDigitalFilter(
        /* Digital filter is configured on port D */
        PORTD,
        /* Digital filter is configured for PORTD0 */
        PORT_DFER_DFE_0_MASK,
        /* Disable digital filter */
        false);

    /* PORTD0 (pin 93) is configured as PTD0 */
    PORT_SetPinMux(DBG1_PORT, DBG1_PIN, kPORT_MuxAsGpio);

    /* PORTD1 (pin 94) is configured as PTD1 */
    PORT_SetPinMux(DBG2_PORT, DBG2_PIN, kPORT_MuxAsGpio);

    /* PORTD2 (pin 95) is configured as PTD2 */
    PORT_SetPinMux(DBG3_PORT, DBG3_PIN, kPORT_MuxAsGpio);

    /* PORTD3 (pin 96) is configured as PTD3 */
    PORT_SetPinMux(DBG4_PORT, DBG4_PIN, kPORT_MuxAsGpio);

    /* PORTD7 (pin 100) is configured as PTD7 */
    PORT_SetPinMux(SD_DETECT_PORT, SD_DETECT_PIN, kPORT_MuxAsGpio);

    /* PORTE0 (pin 1) is configured as SDHC0_D1 */
    PORT_SetPinMux(SD_DAT1_PORT, SD_DAT1_PIN, kPORT_MuxAlt4);

    /* PORTE1 (pin 2) is configured as SDHC0_D0 */
    PORT_SetPinMux(SD_DAT0_PORT, SD_DAT0_PIN, kPORT_MuxAlt4);

    /* PORTE2 (pin 3) is configured as SDHC0_DCLK */
    PORT_SetPinMux(SD_CLK_PORT, SD_CLK_PIN, kPORT_MuxAlt4);

    /* PORTE3 (pin 4) is configured as SDHC0_CMD */
    PORT_SetPinMux(SD_CMD_PORT, SD_CMD_PIN, kPORT_MuxAlt4);

    /* PORTE4 (pin 5) is configured as SDHC0_D3 */
    PORT_SetPinMux(SD_DAT3_PORT, SD_DAT3_PIN, kPORT_MuxAlt4);

    /* PORTE5 (pin 6) is configured as SDHC0_D2 */
    PORT_SetPinMux(SD_DAT2_PORT, SD_DAT2_PIN, kPORT_MuxAlt4);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
